app/views/fleets/_form.html.erb

SELECT "truck_fleets".* FROM "truck_fleets"
---
    <div class="controls">
      <%= collection_select :fleet, :truck_fleet_id, TruckFleet.all, :id, :trading_name_of_business, :promt => true %>