app/views/report/index.html.erb

      <tr>
        <td><%= Fleet.find(:all, :conditions => {:id => service.fleet_id})  %></td>
---
SELECT "fleets".* FROM "fleets" WHERE "fleets"."id" = 3 LIMIT 1