app/controllers/repairers_controller.rb

SELECT "repairers".* FROM "repairers"
---
  def index
    @repairers = Repairer.all