app/controllers/truck_fleets_controller.rb

SELECT "truck_fleets".* FROM "truck_fleets"
---
  def index
    @truck_fleets = TruckFleet.all

SELECT "fleets".* FROM "fleets" WHERE "fleets"."truck_fleet_id" = 1
SELECT "truck_fleets".* FROM "truck_fleets" WHERE "truck_fleets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @truck_fleet = TruckFleet.find(params[:id])

SELECT "truck_fleets".* FROM "truck_fleets" WHERE "truck_fleets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @truck_fleet = TruckFleet.find(params[:id])

INSERT INTO "contact_truck_fleets" ("created_at", "email", "main", "mobile", "title", "truck_fleet_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Wed, 26 Sep 2012 01:42:44 UTC +00:00], ["email", nil], ["main", nil], ["mobile", nil], ["title", nil], ["truck_fleet_id", 2], ["updated_at", Wed, 26 Sep 2012 01:42:44 UTC +00:00]]
INSERT INTO "truck_fleets" ("created_at", "postcode", "state", "street", "street_2", "suburb", "trading_name_of_business", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @truck_fleet = TruckFleet.new(params[:truck_fleet])
    @truck_fleet.contact_truck_fleets.build

    respond_to do |format|
      if @truck_fleet.save

SELECT "truck_fleets".* FROM "truck_fleets" WHERE "truck_fleets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @truck_fleet = TruckFleet.find(params[:id])

SELECT "contact_truck_fleets".* FROM "contact_truck_fleets" WHERE "contact_truck_fleets"."truck_fleet_id" = 2
SELECT "truck_fleets".* FROM "truck_fleets" WHERE "truck_fleets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "contact_truck_fleets" WHERE "contact_truck_fleets"."id" = ?  [["id", 1]]
DELETE FROM "truck_fleets" WHERE "truck_fleets"."id" = ?  [["id", 2]]
---
  def destroy
    @truck_fleet = TruckFleet.find(params[:id])
    @truck_fleet.destroy