app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."approved" = 'f'
SELECT "users".* FROM "users"
---
  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    if params[:approved] == "false"
      @users = User.find_all_by_approved(false)
    else
      @users = User.all